[
    {
        "index": 1,
        "segment": [
            0,
            "4212"
        ],
        "video_transcript": "Are you looking for an over the top burger experience? ",
        "procedure_description": "",
        "video_clip_description": "In a bright, modern kitchen setting, a woman with curly red hair deftly chops an ingredient, likely cheese, on a wooden cutting board. She wears gloves for hygiene while focused on her task, showcasing a professional approach to cooking. In the background are various kitchen utensils and appliances, including a blender, glass bowls, and containers, indicating a well-equipped space for food preparation. A bowl of ground meat sits on the countertop alongside measuring spoons and a bottle, suggesting she is preparing a recipe that",
        "environment_sound_description": "Music is being played with a question mark."
    },
    {
        "index": 2,
        "segment": [
            "4212",
            "7507"
        ],
        "video_transcript": "If you are you've come to the right place. ",
        "procedure_description": "",
        "video_clip_description": "Two ripe, red tomatoes are prominently placed on a kitchen countertop alongside a jar of mustard and a bowl of fresh spinach. The tomatoes are round and plump, showcasing their vibrant color. Behind them, there are sesame seed burger buns resting on a plate. A hand reaches toward the spinach, indicating preparation or separation of leaves likely for a salad or sandwich. The setting appears well-organized, suggesting a cooking or food preparation context. Overall, the items arranged are indicative of the ingredients for a fresh meal",
        "environment_sound_description": "Someone is asking for food in a restaurant kitchen and a chef is responding."
    },
    {
        "index": 3,
        "segment": [
            "7507",
            "14222"
        ],
        "video_transcript": "Today I'm making a blue cheese stuffed burger with a red pepper mayonnaise sauce. ",
        "procedure_description": "",
        "video_clip_description": "Preparation of a meal begins with fresh, vibrant ingredients. Red tomatoes and leafy spinach are prominently displayed, alongside a jar of mustard and sesame burger buns. A pair of hands, gloved for hygiene, skillfully shapes a mixture of ground meat, creating a pocket for a pat of butter, demonstrating the process of making stuffed meat patties. Attention shifts to a food processor, where ingredients are blended together, well-mixed and creamy, indicating a step in the preparation of a sauce or filling. The",
        "environment_sound_description": "A musician is explaining how to make music for a project."
    },
    {
        "index": 4,
        "segment": [
            "14222",
            "17058"
        ],
        "video_transcript": "Sort of like special sauce but with red peppers. ",
        "procedure_description": "",
        "video_clip_description": "Freshly prepared open-faced sandwiches featuring a base of toasted mini bagels topped with layers of sliced tomatoes and a generous amount of fresh spinach leaves. The arrangement shows the vibrant red of the tomatoes contrasting nicely with the deep green of the spinach, creating an appealing and colorful presentation. \n\nIn another scene, a food processor is in use, featuring a translucent bowl filled with a creamy mixture. Ingredients are visibly blending inside, with particles circulating along the sides, indicating the process of mixing or emulsifying. The",
        "environment_sound_description": "A female is speaking about the importance of the environment and the need to protect it."
    },
    {
        "index": 5,
        "segment": [
            "17058",
            "17934"
        ],
        "video_transcript": "It's really delicious. ",
        "procedure_description": "",
        "video_clip_description": "A platter holds four sesame-seeded hamburger buns, each stacked with a beef patty accompanied by layers of fresh spinach and tomato slices. The buns are lightly toasted, showcasing a golden-brown color. The bottom halves of the buns reveal a generous spread of sauce and the vibrant greens and reds from the spinach and tomatoes, respectively. Some buns are positioned neatly on the platter while their tops lie next to the filled bases, indicating preparation or assembly. The overall presentation is appetizing and encourages a fresh,",
        "environment_sound_description": "Someone is talking about food and cooking, and then a recipe is heard, followed by a woman talking."
    },
    {
        "index": 6,
        "segment": [
            "17934",
            "19352"
        ],
        "video_transcript": "I'll get to that in a few minutes. ",
        "procedure_description": "",
        "video_clip_description": "Four sesame-seed topped hamburgers are arranged neatly on a white plate. Each burger consists of a soft, golden-brown bun that encases a juicy beef patty, layered with slices of fresh tomato and crisp spinach leaves. Some burgers display a dollop of sauce peeking out from beneath the top bun, adding a creamy touch to the presentation. The burgers are positioned closely together, emphasizing their appetizing appearance against the clean, simple backdrop. The overall scene conveys a sense of deliciousness and",
        "environment_sound_description": "Someone is asking for food at a restaurant and the waiter is responding."
    },
    {
        "index": 7,
        "segment": [
            "19352",
            "21646"
        ],
        "video_transcript": "But first I'm making my burger mix. ",
        "procedure_description": "Divide the blue cheese into pieces",
        "video_clip_description": "A chef, wearing gloves, is preparing ingredients by cutting blue cheese into smaller pieces on a wooden cutting board. Nearby, a plate displays several freshly made hamburgers. Each burger is assembled with a sesame seed bun, a beef patty, and layers of fresh vegetables, including lettuce and tomatoes, complemented by a sauce. The setting is well-lit, emphasizing the food's vibrant colors and textures, creating an inviting atmosphere for the meal preparation.",
        "environment_sound_description": "A woman is speaking about a trip to the mountains and the beauty of nature."
    },
    {
        "index": 8,
        "segment": [
            "21646",
            "25358"
        ],
        "video_transcript": "I'm dividing a piece of blue cheese into eight pieces. ",
        "procedure_description": "Divide the blue cheese into pieces",
        "video_clip_description": "A person wearing gloves is cutting blue cheese with a large knife on a wooden cutting board. The cheese is crumbled into pieces, showcasing its creamy texture with blue veins. The setting is a modern kitchen, equipped with stainless steel appliances and a clean, organized countertop. Other items in the vicinity include a bowl of ground meat, a measuring spoon, and a small container of sauce, indicating preparation for a recipe that likely involves the cheese and meat together. The person’s expression suggests concentration as they focus on",
        "environment_sound_description": "A recipe is being described by a woman with a warm and friendly voice."
    },
    {
        "index": 9,
        "segment": [
            "25358",
            "27277"
        ],
        "video_transcript": "This could be any kind of cheese that you want. ",
        "procedure_description": "Divide the blue cheese into pieces",
        "video_clip_description": "In a modern kitchen setting, a woman with curly red hair, wearing a white shirt and gloves, is skillfully chopping vegetables on a wooden cutting board. The kitchen features stainless steel appliances and countertops, with various kitchen tools and ingredients visible, including a bowl of ground meat, a glass bowl with chopped ingredients, and a small condiment bottle. The woman focuses intently on her task, showcasing preparation techniques that suggest a cooking tutorial or demonstration. The environment is well-organized and bright, emphasizing a clean",
        "environment_sound_description": "Someone is frying food in a frying pan and talking while music plays in the background and a timer is ticking in the background."
    },
    {
        "index": 10,
        "segment": [
            "27277",
            "29696"
        ],
        "video_transcript": "Brie would work, cheddar would work, etc. ",
        "procedure_description": "Divide the blue cheese into pieces",
        "video_clip_description": "In a well-lit kitchen setting, a woman with curly, reddish hair is preparing food on a wooden cutting board. She wears a white shirt and disposable gloves, indicating a focus on cleanliness. The countertop features various kitchen tools and ingredients, including a bowl of ground meat and small containers with additional components. She uses a knife to chop and crumble a block of blue cheese, showcasing her technique as she breaks it into smaller pieces, which suggests she is likely preparing a filling or topping for a recipe. The",
        "environment_sound_description": "A female voice is announcing a sale."
    },
    {
        "index": 11,
        "segment": [
            "29696",
            "30488"
        ],
        "video_transcript": "etc. ",
        "procedure_description": "",
        "video_clip_description": "A person is preparing blue cheese on a wooden cutting board, using a knife and their gloved hand to break apart the cheese into smaller pieces. The cheese has a crumbly texture, with visible blue veining. The environment appears clean and organized, suggesting a culinary setting. The individual’s focus is on manipulating the cheese, indicating a step in a food preparation process, possibly for a recipe or serving.",
        "environment_sound_description": "A woman is reading a script about a vegetarian restaurant and a vegetarian menu."
    },
    {
        "index": 12,
        "segment": [
            "30488",
            "33074"
        ],
        "video_transcript": "so I've divided my blue cheese into eight pieces. ",
        "procedure_description": "",
        "video_clip_description": "The series of screenshots depicts a culinary demonstration focused on food preparation. A woman with curly red hair is engaged in the meticulous task of cutting and handling food, showcasing her skills in a bright, modern kitchen setting. She is wearing a fitted white shirt and gloves, indicating hygiene while working with ingredients.\n\nThe primary objects include a wooden cutting board where she is slicing cheese and various meats. A serrated knife lies prominently on the board, alongside ingredients that appear to be a mixture of ground meat and cheese.",
        "environment_sound_description": "A waterfall is being played with."
    },
    {
        "index": 13,
        "segment": [
            "33074",
            "34325"
        ],
        "video_transcript": "You may notice I'm wearing gloves. ",
        "procedure_description": "",
        "video_clip_description": "A person with curly red hair is actively engaged in food preparation in a modern kitchen. They wear a fitted white shirt and gloves, focusing on a cutting board where they are neatly arranging pieces of food, likely for a dish. A knife rests beside the food on the board, while bowls with various ingredients, including a substantial amount of ground meat and several measuring spoons, are positioned nearby. Clear storage jars housing ingredients like sugar sit in the background, alongside contemporary kitchen appliances, creating a well-organized",
        "environment_sound_description": "Someone is cutting vegetables for a restaurant."
    },
    {
        "index": 14,
        "segment": [
            "34325",
            "37954"
        ],
        "video_transcript": "I'm just doing that because blue cheese does have kind of a strong scent. ",
        "procedure_description": "",
        "video_clip_description": "A woman with curly red hair is focused on preparing food in a modern kitchen. She is wearing a fitted white shirt and gloves while working on a wooden cutting board. The cutting board holds neatly cut pieces of dough or pasta, which she is likely filling or shaping. To the right, there is a large bowl filled with raw ground meat and various measuring cups and a small bottle of sauce, indicating a cooking process involving meat. The kitchen is well-lit and features stainless steel surfaces, with other cooking tools",
        "environment_sound_description": "Someone is reciting a poem."
    },
    {
        "index": 15,
        "segment": [
            "37954",
            "42459"
        ],
        "video_transcript": "And if you are concerned about that on your hands, wear a pair of gloves. ",
        "procedure_description": "",
        "video_clip_description": "A kitchen setting features a countertop with neat arrangements of food preparation items. Chunks of cheese, possibly blue cheese, are neatly placed in a row on a wooden cutting board, indicating they have been cut for use. A person with distinctive red hair, wearing a fitted white shirt and disposable gloves, is actively engaged in preparing these cheese pieces. A sharp knife rests on the board alongside measuring utensils. In the background, various kitchen tools and containers are visible, contributing to a well-organized culinary environment.",
        "environment_sound_description": "Someone is saying something funny about a cat and a mouse in a funny way."
    },
    {
        "index": 16,
        "segment": [
            "42459",
            "45211"
        ],
        "video_transcript": "Also, I'm going to be touching meat and then I won't have to wash my hands. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "In a modern kitchen setting, a person wearing white gloves is engaged in food preparation. They are handling a large amount of ground meat, which is placed in a glass bowl on a wooden cutting board. A sharp knife rests nearby, along with small portions of dough or filling indicated by round shapes. The individual appears to be explaining or demonstrating a recipe, with an expressive demeanor suggesting engagement with the audience. In the background, various kitchen utensils and ingredients are organized, indicating a professional cooking environment.",
        "environment_sound_description": "Someone is cutting a piece of food."
    },
    {
        "index": 17,
        "segment": [
            "45211",
            "47047"
        ],
        "video_transcript": "Here I have 3 pounds of meat. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A glass bowl contains a sizable portion of ground meat, with gloved hands mixing or shaping it. The bowl is placed on a wooden cutting board, which has a knife with a black handle and a silver blade positioned nearby. The scene conveys a focused cooking preparation process, emphasizing cleanliness and care in handling raw meat.",
        "environment_sound_description": "A woman is speaking in a soft voice."
    },
    {
        "index": 18,
        "segment": [
            "47047",
            "51426"
        ],
        "video_transcript": "It's ground chuck to that I'm going to add a tablespoon of course salt. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A woman in a kitchen prepares ingredients, prominently featuring ground meat in a bowl. She wears gloves and is in the process of seasoning the meat, with salt being added from a measuring spoon. Nearby, a block of blue cheese is positioned on a wooden cutting board along with a knife, indicating additional ingredients for the recipe. The kitchen is modern, with stainless steel surfaces and various utensils visible, contributing to a well-organized cooking environment. The focus is on combining ingredients for a dish, highlighting both the",
        "environment_sound_description": "A person is speaking about a recipe."
    },
    {
        "index": 19,
        "segment": [
            "51426",
            "59684"
        ],
        "video_transcript": "If you're using fine salt or if you're using a particularly salty brand, of course salt, use a teaspoon and a half to two teaspoons. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "In a well-lit kitchen, a woman with red curly hair prepares a dish, showcasing a bowl of ground meat mixed with salt. She is wearing gloves and appears focused, holding a measuring spoon as she measures out ingredients. The countertop features a wooden cutting board with neatly arranged small portions of dough and a knife, indicating preparation for a recipe that involves meat and possibly dumplings or pastries. Behind her, various kitchen tools and ingredients are neatly organized, enhancing the cooking environment.",
        "environment_sound_description": "Someone is speaking in a foreign language."
    },
    {
        "index": 20,
        "segment": [
            "59684",
            "63438"
        ],
        "video_transcript": "Also going to season the meat with a teaspoon of freshly ground black pepper. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A person is preparing a meat mixture in a well-equipped kitchen, wearing gloves and a fitted white shirt. They stand next to a bowl filled with raw ground meat, possibly beef, along with salt and various spices. A mixing bowl is placed on a wooden cutting board, while utensils, including a knife and measuring cups, are arranged neatly. In the background, a clean, modern kitchen setup is visible, featuring stainless steel surfaces, jars, and cooking equipment, indicating an organized cooking environment. Additional ingredients",
        "environment_sound_description": "A woman is speaking with a high-pitched voice and a soft tone."
    },
    {
        "index": 21,
        "segment": [
            "63438",
            "68735"
        ],
        "video_transcript": "Normally when I'm making burgers, I don't seasoned the meat at all except for with salt and pepper as I'm cooking it. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A person is preparing a meat mixture in a modern kitchen, wearing gloves to maintain hygiene. Ground meat, salt, and spices are combined in a large mixing bowl. The individual adds seasonings to the mixture, displaying an array of ingredients and tools on the kitchen counter, including a cutting board and a knife. There are containers, bottles, and utensils in the background, contributing to a well-organized cooking environment. The focus is on the preparation process, showcasing the steps to make a dish, likely",
        "environment_sound_description": "A woman is speaking over a speaker system."
    },
    {
        "index": 22,
        "segment": [
            "68735",
            "73281"
        ],
        "video_transcript": "So this one's a little bit special because I actually am putting flavoring right in the burger. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A woman in a white shirt and gloves prepares ingredients in a modern kitchen. She stands at a stainless steel counter, mixing ground meat in a bowl with various spices. Nearby, neatly arranged are small portions of dough, likely for a dish being prepared, and a chopping knife. On the right, a brown bottle and two small metal bowls are visible, indicating additional ingredients or seasonings to be added. The environment is bright and well-organized, emphasizing a clean and efficient cooking space.",
        "environment_sound_description": "A woman is speaking and a woman is eating and a woman is speaking again."
    },
    {
        "index": 23,
        "segment": [
            "73281",
            "78036"
        ],
        "video_transcript": "Now add two tablespoons plus two teaspoons of Worcestershire sauce. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A lively kitchen scene features a person preparing a meat-based dish. The individual, wearing a short-sleeved white shirt and disposable gloves, is engaged in mixing ground meat in a glass bowl, while seasonings are added from a spoon and a dark bottle nearby. Various ingredients, including possibly herbs and spices, are also positioned on the workspace. The kitchen is well-lit, showcasing stainless steel surfaces and storage units in the background, indicating a professional cooking environment. The person appears focused on their task,",
        "environment_sound_description": "A woman is speaking in a harmonious and melodic way with a full and rich voice."
    },
    {
        "index": 24,
        "segment": [
            "78036",
            "80205"
        ],
        "video_transcript": "World's hardest word to say. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A home cook is preparing a dish involving ground meat. She wears white gloves and a short-sleeve shirt, conveying a clean and hygienic cooking environment. On a wooden countertop, a large glass bowl contains raw ground meat mixed with salt and spices. The cook holds a measuring spoon filled with a dark liquid, possibly a sauce or seasoning, which she is about to pour into the bowl. The kitchen background features stainless steel surfaces and various kitchen tools, emphasizing a modern, well-organized space.",
        "environment_sound_description": "A woman is speaking in a foreign language."
    },
    {
        "index": 25,
        "segment": [
            "80205",
            "81331"
        ],
        "video_transcript": "Very delicious. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "Ground meat is placed in a clear glass bowl, accompanied by salt and a mix of spices on top. A person, wearing a disposable glove, pours a liquid from a metal measuring spoon onto the meat. The focus is on the actions of seasoning and preparing the meat, highlighting care in hygiene and the process of enhancing flavor. The background appears to be a neutral-colored kitchen setting, emphasizing the food preparation.",
        "environment_sound_description": "A woman is speaking with a high-pitched, melodic voice."
    },
    {
        "index": 26,
        "segment": [
            "81331",
            "83083"
        ],
        "video_transcript": "Great depth of flavor. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "Ground beef is placed in a glass mixing bowl, topped with seasonings including salt and pepper. A person wearing gloves is using a metal measuring spoon to add a liquid ingredient, likely a sauce, to the meat mixture. The setting appears to be a kitchen, with a focus on preparing a meat dish. The objects involved include the glass bowl, the raw ground beef, various seasonings in the bowl, and a bottle of sauce positioned within reach for pouring. Overall, the scene conveys a methodical",
        "environment_sound_description": "Someone is speaking in a foreign language."
    },
    {
        "index": 27,
        "segment": [
            "83083",
            "84292"
        ],
        "video_transcript": "Umami. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A prepared workspace is shown with a glass mixing bowl containing raw ground meat, which is surrounded by white granulated salt and various spices. A person wearing a white glove is in the process of adding a liquid ingredient from a metal spoon, likely a sauce or seasoning, directly onto the meat mixture. The scene suggests a cooking process, emphasizing the careful preparation and mixing of ingredients before they are combined into a dish. The focus is on cleanliness, as indicated by the use of gloves, indicating a methodical",
        "environment_sound_description": "A woman is reading a poem in a foreign language."
    },
    {
        "index": 28,
        "segment": [
            "84292",
            "88755"
        ],
        "video_transcript": "What we're doing is giving our burgers a little bit of a steakhouse flavor. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A woman with curly red hair is in a modern kitchen, actively preparing food. She stands at a counter with a bowl containing raw ground meat, seasonings, and other ingredients. A spoon is in her right hand, and she appears to be adding an ingredient from a bottle held in her left hand. In front of her on the cutting board, there are several neatly arranged pieces of what looks like dough or vegetables. The kitchen is spacious, with stainless steel surfaces, and various cooking utensils and jars",
        "environment_sound_description": "A woman is speaking in a restaurant kitchen."
    },
    {
        "index": 29,
        "segment": [
            "88755",
            "91549"
        ],
        "video_transcript": "Because A1 has a flavor that's sort of similar. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A woman with curly red hair is preparing a dish in a modern kitchen. She stands at a counter with a bowl filled with ground meat, using a spoon to add ingredients, while holding a bottle of sauce in her other hand. The table features a chopping board with small, dumpling-like shapes made of dough and a knife beside it. Various kitchen utensils and containers clutter the background, indicating a busy cooking environment. The kitchen has a bright, airy feel with stainless steel and glass elements.",
        "environment_sound_description": "A woman is speaking in a restaurant kitchen."
    },
    {
        "index": 30,
        "segment": [
            "91549",
            "92050"
        ],
        "video_transcript": "Worcestershire. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A woman with curly red hair is in a bright, modern kitchen preparing food. She stands at a kitchen island, wearing a white shirt and gloves, actively mixing ingredients in a large glass bowl filled with ground meat, while holding a bottle of sauce in her other hand. Nearby, a wooden chopping board displays small formed pieces of dough filled with filling, indicating she is making a dish that requires assembling. Metal bowls and a knife are also present on the board, suggesting additional preparation activities. The kitchen is",
        "environment_sound_description": "A woman is speaking into a microphone."
    },
    {
        "index": 31,
        "segment": [
            "92050",
            "92801"
        ],
        "video_transcript": "Right? ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A kitchen scene features a person preparing ground meat in a glass bowl, adding seasonings like salt, pepper, and a liquid ingredient from a bottle. The individual, wearing a white shirt and gloves, demonstrates the mixing process. A wooden cutting board displays neatly shaped portions of dough or meat arranged in a line, suggesting preparation for a recipe. The kitchen is well-lit, with modern appliances in the background, emphasizing an organized and professional cooking environment.",
        "environment_sound_description": "A woman is speaking about food and recipes in a kitchen."
    },
    {
        "index": 32,
        "segment": [
            "92801",
            "95345"
        ],
        "video_transcript": "So we're that's what we're doing with the blue cheese, etc.. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "Ground meat is placed in a clear glass bowl, where various seasoning ingredients, including salt and pepper, are already added on top. A person, wearing a white glove, is pouring a liquid ingredient, likely soy sauce, from a dark bottle into a measuring spoon above the meat, preparing to enhance the flavor of the mixture. The focus is on the combination of fresh meat and seasonings, emphasizing the process of meal preparation.",
        "environment_sound_description": "Someone is eating and talking about food with a microphone in a kitchen."
    },
    {
        "index": 33,
        "segment": [
            "95345",
            "101976"
        ],
        "video_transcript": "You get the best two tablespoons plus two teaspoons and then mix everything together. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A glass bowl filled with raw ground meat is the focal point, with salt and spices sprinkled on top. A person, wearing white gloves, is pouring a dark liquid, likely sauce, into the bowl from a small measuring spoon held in one hand. The setting is a bright, modern kitchen equipped with stainless steel appliances and organized neatly. The person is engaged in mixing the ingredients, using both hands to thoroughly combine everything in the bowl, enhancing textural consistency. Nearby, tools like a knife and additional",
        "environment_sound_description": "A woman is speaking to a man, and the man is responding."
    },
    {
        "index": 34,
        "segment": [
            "101976",
            "108942"
        ],
        "video_transcript": "You don't want to overwork your meat which is one of the reasons why I generally don't add seasonings to my burgers. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "Hands wearing white gloves are mixing raw ground meat in a clear glass bowl. The mixture includes a variety of ground meats with a slightly moist texture. A wooden surface serves as the countertop where the bowl is placed. The hands integrate the ingredients vigorously, ensuring an even distribution. The setting has a minimalistic design with a soft background, indicating a focused cooking environment. Ingredients may include seasonings visible in the bowl, contributing to the preparation of a meat-based dish.",
        "environment_sound_description": "A woman is speaking in a foreign language."
    },
    {
        "index": 35,
        "segment": [
            "108942",
            "114614"
        ],
        "video_transcript": "But sometimes it's just nice to have that flavor right inside, right when I fancy it up. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A person is preparing a meat mixture, wearing gloves and displaying focused engagement in the task. They are seen mixing raw ground meat in a clear glass bowl, using both hands to thoroughly combine the ingredients. The workspace features a wooden cutting board beneath the bowl, with a knife positioned nearby. To the side, there are several small portions of a pastry or dough arranged neatly. A few bottles, including one with a label and a dark brown color, are also present on the countertop, indicating ingredients or sauces",
        "environment_sound_description": "A woman is speaking in a foreign language."
    },
    {
        "index": 36,
        "segment": [
            "114614",
            "117283"
        ],
        "video_transcript": "Sometimes this is your fancy but easy burger. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A person wearing disposable gloves is mixing raw ground meat in a clear glass bowl. The meat appears to be a mix of different shades of red and pink. The bowl is placed on a wooden cutting board, which is positioned on a countertop. The hands are engaged in thoroughly combining the meat, indicating preparation for cooking. A knife is visible on the board, suggesting that other ingredients or further preparation might follow in the cooking process. The setting is clean and organized, typical of a cooking environment.",
        "environment_sound_description": "A woman is speaking about a recipe."
    },
    {
        "index": 37,
        "segment": [
            "117283",
            "120495"
        ],
        "video_transcript": "Mix it all together. ",
        "procedure_description": "Add salt, black pepper, and flavored salt to ground chopped meat and mix",
        "video_clip_description": "A person with distinctive red hair is seen preparing a meat mixture in a clear glass bowl on a countertop. They are wearing white gloves and actively mixing raw meat, suggesting a focus on hygiene while handling food. A large knife rests on the cutting board in front of them, indicating further food preparation. Other ingredients and utensils, including a bottle of sauce and measuring cups, are visible on the countertop, contributing to a well-organized kitchen setting. The individual appears engaged and animated, likely explaining the process or",
        "environment_sound_description": "Someone is saying a prayer in a theater."
    },
    {
        "index": 38,
        "segment": [
            "120495",
            "125166"
        ],
        "video_transcript": "Make sure that all of the seasonings are well distributed throughout your meat. ",
        "procedure_description": "",
        "video_clip_description": "Ground meat is prominently displayed in a large glass bowl, with emphasis on the raw texture and color of the meat. A person wearing gloves is actively mixing the meat with their hands, indicating preparation for further cooking. The surrounding environment is a modern kitchen, featuring stainless steel surfaces and various kitchen tools. A cutting board holds neatly cut pieces of an ingredient, possibly vegetables, alongside a knife and bottles, suggesting additional meal preparation steps. The focus is on the hands and ingredients, capturing the act of cooking and",
        "environment_sound_description": "Someone is describing a recipe in a cooking show with a background music."
    },
    {
        "index": 39,
        "segment": [
            "125166",
            "128378"
        ],
        "video_transcript": "Then divide your meat into eight mounds. ",
        "procedure_description": "",
        "video_clip_description": "Consecutive screenshots depict the preparation of ground meat for cooking. A person, wearing white gloves, is handling a sizable portion of raw ground beef, which is stored in a clear glass bowl placed on a countertop. The meat exhibits a bright red color and a coarse, textured appearance. The individual is focused on shaping or manipulating the meat, indicating an intention to form patties or a similar dish. The kitchen environment is well-lit, emphasizing cleanliness and the fresh look of the ingredients. No other kitchenware",
        "environment_sound_description": "Someone is describing a recipe."
    },
    {
        "index": 40,
        "segment": [
            "128378",
            "130463"
        ],
        "video_transcript": "This is enough for eight burgers. ",
        "procedure_description": "",
        "video_clip_description": "A woman with curly red hair is in a bright, modern kitchen, preparing food. She wears a white shirt and gloves while working with ground meat in a glass bowl on a wooden cutting board. The meat looks fresh and is being shaped into portions. Various ingredients and utensils can be seen around her, including small bowls and a bottle, suggesting she is in the process of making a recipe. The kitchen is well-organized, with clean surfaces and ample natural light, contributing to a cheerful cooking atmosphere.",
        "environment_sound_description": "Someone is speaking in a foreign language."
    },
    {
        "index": 41,
        "segment": [
            "130463",
            "134926"
        ],
        "video_transcript": "You want to make sure that they're sort of evenly divided before you pass them into your burger. ",
        "procedure_description": "",
        "video_clip_description": "A woman with vibrant red curly hair is shown in a modern kitchen setting, engaged in preparing a dish. She is wearing a white shirt and gloves, mixing a bowl of raw meat. The countertop is organized with a cutting board displaying raw meatballs and neatly arranged pieces of another ingredient. Various kitchen tools and ingredients, including a bottle of sauce or marinade and measuring cups, are visible on the counter. The environment is bright and well-equipped, suggesting a focus on cooking and food preparation.",
        "environment_sound_description": "A woman is talking about cooking with oil and butter in a kitchen."
    },
    {
        "index": 42,
        "segment": [
            "134926",
            "137095"
        ],
        "video_transcript": "So do the dividing first. ",
        "procedure_description": "",
        "video_clip_description": "A person in a kitchen prepares ground meat, wearing gloves for hygiene. Several shaped portions of raw ground beef rest on a wooden cutting board, with a clear bowl of mixed ingredients beside the person. The individual is focused on the process, combining ingredients in the bowl, while ingredients like butter and seasoning bottles are also visible. The environment is bright and modern, featuring a well-organized kitchen with equipment and jars in the background.",
        "environment_sound_description": "A woman is speaking in a foreign language."
    },
    {
        "index": 43,
        "segment": [
            "137095",
            "151151"
        ],
        "video_transcript": "Once you're satisfied that your mixture is evenly divided between all your burgers, what you want to do is just shape them into your burger shape and then make a well in the center, which is where you're going to add your blue cheese. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "A clean kitchen workspace features a wooden cutting board with several portions of raw ground meat shaped into balls. The meat portions vary in size and are neatly arranged alongside small dollops of a pale substance, possibly cheese or a seasoning mixture. An individual wearing a white glove expertly shapes and manipulates the meat, while their focused expression indicates they are demonstrating a cooking technique. A glass mixing bowl is visible in the background, along with various kitchen tools and ingredients, suggesting the preparation of a larger recipe or meal.",
        "environment_sound_description": "The audio is a woman speaking in a soft and gentle voice."
    },
    {
        "index": 44,
        "segment": [
            "151151",
            "162745"
        ],
        "video_transcript": "To make a little hole slash well, and just take a piece of blue cheese and put it into the center, tuck it in, fold it over. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "A woman with curly red hair, wearing a white shirt and gloves, is preparing ground meat in a modern kitchen. She is molding the meat into uniform balls, demonstrating careful handling and creating consistency in size. The kitchen is clean and organized, featuring stainless steel appliances, a glass bowl for mixing, and various ingredients visible in the background. A light, bright atmosphere enhances the cooking process, focusing on the raw meat and her technique. Various utensils, including a small bowl and sauces, are positioned nearby,",
        "environment_sound_description": "The audio description is of a woman speaking about a recipe."
    },
    {
        "index": 45,
        "segment": [
            "162745",
            "164372"
        ],
        "video_transcript": "Pat it down. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "Hands, covered in disposable gloves, manipulate raw ground meat on a wooden cutting board. The meat is shaped and compressed, likely forming patties or meatballs. The use of gloves indicates a focus on hygiene during food preparation. The surface of the cutting board is lightly marked, showing signs of previous use. The ground meat appears fresh, with a rich red color and a textured surface. The hands are positioned to mold and compact the meat effectively, showcasing a methodical approach to preparation.",
        "environment_sound_description": "The audio description is about someone eating a cucumber."
    },
    {
        "index": 46,
        "segment": [
            "164372",
            "165790"
        ],
        "video_transcript": "No one will ever know. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "Hands in white gloves are shaping raw ground meat into uniform patties on a wooden cutting board. The focus is on the texture and color of the meat, highlighting its fresh, red appearance. The patties are being carefully formed and placed alongside each other, emphasizing precision and attention to cleanliness in the preparation process. The setting suggests a kitchen environment, and the use of gloves indicates a hygienic approach to food handling.",
        "environment_sound_description": "The audio is of a woman speaking.  It is rich in frequency components.  It is rich in frequency components.  It is rich in frequency components.  It is rich in frequency components.  It is rich in frequency components."
    },
    {
        "index": 47,
        "segment": [
            "165790",
            "168126"
        ],
        "video_transcript": "Make sure it's nice and well enclosed. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "A person is preparing raw ground meat on a wooden cutting board, wearing white gloves for hygiene. They are shaping the meat into burger patties, focusing on evenness and consistency. Surrounding the patties are small chunks of cheese, likely intended to be incorporated into the patties themselves. The kitchen has a modern, clean design with various cooking utensils visible in the background, including a bowl, sauces, and kitchen appliances. The individual appears engaged and methodical in their process, indicating a careful approach",
        "environment_sound_description": "The audio is of a woman speaking in a domestic setting."
    },
    {
        "index": 48,
        "segment": [
            "168126",
            "171129"
        ],
        "video_transcript": "Otherwise, as you're cooking it, the cheese could come out. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "A woman with curly red hair, wearing a white shirt and gloves, is preparing food in a modern kitchen. She is focused on shaping raw ground meat into burger patties on a wooden cutting board. The patties are arranged neatly on the board, alongside small cubes of cheese. A clear bowl is positioned nearby, and there are various utensils and condiments, including a bottle of sauce, visible on the countertop. The kitchen is well-lit and features stainless steel appliances and a minimalist design.",
        "environment_sound_description": "The audio description is about a woman speaking about a recipe book."
    },
    {
        "index": 49,
        "segment": [
            "171129",
            "190398"
        ],
        "video_transcript": "You might want to give people a choice of blue cheese and cheddar or mozzarella to make a variety of different cheeses, and then offer your friends and guests and family a choice if you want to make these ahead, just keep them in a single layer on a baking sheet, cover with plastic in the refrigerator, and you can do it in the morning. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "Ground beef patties are being prepared on a wooden cutting board in a well-lit kitchen setting. The individual is wearing white gloves while shaping the beef into round patties. Next to the patties, there are pieces of butter or cheese available for stuffing. The person demonstrates creating an indentation in the patty and placing a piece of butter inside, possibly for a stuffed burger. The countertop is clean, with various kitchen tools and ingredients visible in the background, suggesting a cooking demonstration for making gourmet burgers.",
        "environment_sound_description": "The audio is a mixture of speech and non-speech sounds."
    },
    {
        "index": 50,
        "segment": [
            "190398",
            "192567"
        ],
        "video_transcript": "Probably do it the day ahead. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "In the video clip, raw ground meat is being shaped into patties on a wooden cutting board. A gloved hand is creating a small indentation in each patty, likely for stuffing purposes. Nearby, there are more patties waiting to be filled. The preparation focuses on ensuring the meat is formed properly, highlighting the technique of creating space for a filling, which suggests a recipe for stuffed meat items such as burgers. The environment appears clean and organized, emphasizing a cooking context.",
        "environment_sound_description": "The audio is of a woman speaking with a high-pitched voice and a soft tone."
    },
    {
        "index": 51,
        "segment": [
            "192567",
            "195320"
        ],
        "video_transcript": "I've never done that, but you could definitely do it the morning ahead. ",
        "procedure_description": "Place the cheese inside the meat",
        "video_clip_description": "A person is making stuffed meat patties on a wooden cutting board. They are wearing white gloves while shaping ground meat into a circular mold, pushing a piece of butter into the center to create a stuffing. Several raw meat patties are visible, some already formed and others still being shaped. The scene emphasizes preparation for cooking, highlighting the technique and attention to detail in the process of creating flavorful stuffed patties.",
        "environment_sound_description": "This audio clip does not contain any descriptions."
    },
    {
        "index": 52,
        "segment": [
            "195320",
            "199449"
        ],
        "video_transcript": "A nice, firm, chilled burgers are really easy to grill. ",
        "procedure_description": "",
        "video_clip_description": "Ground beef patties are being prepared on a tray lined with parchment paper. The patties are uniform in shape, indicating careful handling by someone wearing white gloves. After forming the patties, a small indentation is made in the center of one with a stick of butter, suggesting that the patties are being prepared for a specific cooking method, likely to enhance flavor and juiciness by adding melted butter inside. The scene emphasizes cleanliness and precision in the food preparation process.",
        "environment_sound_description": "The audio is of someone eating ice cubes in a cup."
    },
    {
        "index": 53,
        "segment": [
            "199449",
            "201284"
        ],
        "video_transcript": "Excellent. ",
        "procedure_description": "",
        "video_clip_description": "Ground beef is shaped into evenly sized patties on a tray lined with parchment paper. The patties are thick and have a slightly irregular, textured surface, showcasing the quality of the meat. The hands, covered in white gloves, manipulate the meat with care, ensuring a uniform shape and consistent thickness. The tray holds multiple patties, arranged closely, indicating preparation for cooking. The background suggests a clean kitchen environment, with natural light enhancing the freshness of the ingredients.",
        "environment_sound_description": "The non-speech part of the audio is the sound of cutlery and silverware being used."
    },
    {
        "index": 54,
        "segment": [
            "201284",
            "202452"
        ],
        "video_transcript": "All done. ",
        "procedure_description": "",
        "video_clip_description": "In a bright kitchen setting, a person with curly red hair is engaged in food preparation. They start by mixing ingredients in a bowl, using a whisk, and seem focused on the task. A wooden cutting board is prominently placed in front, showing some meat that appears to be ground beef. Clean, stainless steel surfaces and organized containers are visible, indicating a well-maintained kitchen.\n\nThe next scene focuses on the formation of patties from the ground meat, with gloved hands pressing and shaping the mixture",
        "environment_sound_description": "The audio is of people talking in a room.  It is not clear what they are talking about."
    },
    {
        "index": 55,
        "segment": [
            "202452",
            "203953"
        ],
        "video_transcript": "Gloves off. ",
        "procedure_description": "",
        "video_clip_description": "In a well-lit kitchen, a woman with curly red hair prepares food. She mixes ingredients in a bowl with one hand, while the other holds a bottle, likely a condiment or seasoning, demonstrating a cooking technique. On a wooden cutting board, partially ground meat is being shaped into patties, indicating the preparation of burgers. She meticulously forms each patty, placing them on a tray lined with parchment paper. Various kitchen tools and appliances are visible in the background, emphasizing the organized and modern kitchen setup",
        "environment_sound_description": "he non-speech part of the audio is characterized by a mixture of different sounds, including the sound of a person speaking, the sound of a group of people talking, the sound of a door opening or closing, the sound of a car passing by, the sound of a person coughing, the sound of a person breathing, the sound of a person laughing, the sound of a person crying, the sound of a person shouting, the sound of a person screaming, the sound of a person whispering, the sound of a person talking, the sound of a person singing, the sound of a person playing an instrument, the sound of a person clapping, the sound of a person tapping, the sound of a person typing, the sound of a person writing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a person typing, the sound of a pe"
    },
    {
        "index": 56,
        "segment": [
            "203953",
            "206706"
        ],
        "video_transcript": "To the grill. ",
        "procedure_description": "",
        "video_clip_description": "A person is preparing ingredients in a modern kitchen setting, showcasing a clean and organized workspace. The individual mixes ingredients in a bowl while standing beside a large cutting board that has meat patties placed on it. These patties are made of ground beef, arranged neatly on a metal tray nearby. Various cooking tools and ingredients, such as bottles and bowls, are visible around, emphasizing a cooking process. The kitchen has stainless steel surfaces, bright natural lighting, and a minimalist aesthetic, contributing to a professional cooking",
        "environment_sound_description": "The non-speech part of the audio is characterized by the sounds of a woman speaking and a child speaking. The woman's voice is deep and clear, while the child's voice is high-pitched and clear."
    },
    {
        "index": 57,
        "segment": [
            "206706",
            "210668"
        ],
        "video_transcript": "Make sure that your grill is preheated. ",
        "procedure_description": "",
        "video_clip_description": "In a bright kitchen, a woman with curly red hair prepares to cook hamburgers. She is dressed casually in a white top and a beige apron. A tray of raw hamburger patties is positioned on the countertop in front of her. She is sprinkling seasoning or oil on the patties while standing next to a grill pan that's ready for cooking. The kitchen is well-equipped, featuring various cooking utensils, a blender, fresh vegetables, bottles of oil, and a shiny sink. The overall atmosphere conveys",
        "environment_sound_description": "The audio clip features a woman speaking in a warm and inviting environment. The sounds are domestic and homey, with the sound of a cupboard opening and closing. The woman's voice is clear and distinct, and the sounds are muted and soft."
    },
    {
        "index": 58,
        "segment": [
            "210668",
            "211419"
        ],
        "video_transcript": "Nice and hot. ",
        "procedure_description": "",
        "video_clip_description": "A bright kitchen setting features a person with curly red hair preparing food. On a stainless-steel counter, there is a tray of raw burger patties, and the person is sprinkling seasoning onto them. To the left, various cooking oils are stored in bottles alongside utensils and fresh ingredients like leafy greens and red bell peppers. In the background, kitchen appliances, including a food processor, and additional cooking tools are visible, creating an organized and functional atmosphere. The main focus is on the preparation of the",
        "environment_sound_description": "The audio is of a woman speaking inside a store."
    },
    {
        "index": 59,
        "segment": [
            "211419",
            "212170"
        ],
        "video_transcript": "Nice and clean. ",
        "procedure_description": "",
        "video_clip_description": "In a bright kitchen environment, a woman with curly red hair is preparing a meal. She stands near a stainless steel countertop, focusing on a tray filled with raw hamburger patties. With one hand, she is sprinkling seasoning onto the patties while holding a small container in the other hand. The counter features various objects, including two bottles of oil, a bowl of fresh greens, and two red peppers. A large, ridged griddle pan is positioned to the side, suggesting it's ready for",
        "environment_sound_description": "The non-speech part of the audio is a woman speaking."
    },
    {
        "index": 60,
        "segment": [
            "212170",
            "214422"
        ],
        "video_transcript": "And give it a little brush with oil. ",
        "procedure_description": "",
        "video_clip_description": "A bright kitchen setting features a woman preparing for cooking. She stands at a stainless steel countertop, assembling ingredients for making patties placed on a tray. Nearby, a grill pan sits ready for use. The woman pours oil from a small bowl onto the grill, ensuring it is prepared for cooking. The background is organized with kitchen tools, including spatulas and a food processor, while fresh vegetables lie in a bowl. The overall atmosphere is inviting, emphasizing a focus on meal preparation.",
        "environment_sound_description": "The audio is of a woman speaking in a small room, with the sounds of a door opening and closing."
    },
    {
        "index": 61,
        "segment": [
            "214422",
            "215840"
        ],
        "video_transcript": "Just for safety's sake. ",
        "procedure_description": "",
        "video_clip_description": "A griddle is being prepared for cooking, with a person using a brush to apply a small amount of oil from a clear glass bowl onto its surface. The griddle features raised lines indicating its grilling design, while ground meat is visible on a plate next to it, suggesting the intended cooking process. The overall setting appears to be a kitchen, with the cooking surface prominently in focus.",
        "environment_sound_description": "The audio is of a woman speaking in a small room, with the sound of a spray can and a zipper in the background, suggesting a domestic or personal activity."
    },
    {
        "index": 62,
        "segment": [
            "215840",
            "220220"
        ],
        "video_transcript": "There's quite a bit of fat in ground, chuck, but you never know. ",
        "procedure_description": "",
        "video_clip_description": "In a bright kitchen, a person with curly red hair is preparing to cook on a grill pan. They are holding a small bowl with oil and using a spatula to coat the grill surface, ensuring it’s ready for cooking. The stainless steel countertop features a bowl of fresh vegetables, two red bell peppers, and a tray of ground meat, suggesting a focus on healthy, hearty cooking. The overall setup is organized and clean, with ample natural light illuminating the space, enhancing the inviting and warm atmosphere",
        "environment_sound_description": "The audio is of a woman speaking in a small room, with the sound of writing on a blackboard."
    },
    {
        "index": 63,
        "segment": [
            "220220",
            "221471"
        ],
        "video_transcript": "Just be safe. ",
        "procedure_description": "",
        "video_clip_description": "A kitchen setting features a smiling woman with curly red hair, wearing a fitted white shirt and a brown skirt. She stands behind a stainless steel counter, actively seasoning a grill pan with a sprinkle of salt from a bowl in her right hand. The grill pan is preheated and produces steam, indicating it's ready for cooking. Nearby, there are fresh ingredients, including a bowl of leafy greens, tomatoes, and several raw patties of meat waiting to be cooked. Bottles of oil are situated on the",
        "environment_sound_description": "The audio is of a woman speaking and a zipper being used, possibly indicating a clothing item."
    },
    {
        "index": 64,
        "segment": [
            "221471",
            "222347"
        ],
        "video_transcript": "Be careful. ",
        "procedure_description": "",
        "video_clip_description": "A cheerful person is preparing to cook in a bright and modern kitchen. She holds a glass bowl while seasoning a hot grill pan with salt. In the foreground, there are several uncooked patties on a platter, likely meant for grilling. On the countertop, various cooking utensils are neatly organized, and there's an assortment of ingredients, including fresh vegetables and oils, suggesting the preparation of a flavorful meal. The overall atmosphere is inviting and energetic, highlighting a vibrant cooking process.",
        "environment_sound_description": "The audio is of a woman speaking in a small room, with the sounds of breathing and surface contact."
    },
    {
        "index": 65,
        "segment": [
            "222347",
            "227310"
        ],
        "video_transcript": "As you can see, I'm brushing with a handheld piece of paper towel. ",
        "procedure_description": "",
        "video_clip_description": "A woman in a kitchen is preparing to cook on a grill pan. She’s smiling and engaging the audience while holding a glass dish, likely containing oil or a seasoning. The grill pan is positioned on the stove, steaming as she sprinkles seasoning onto it. Behind her, there are various kitchen tools including spatulas in a container, a bowl with greens, and several whole tomatoes on the counter. Meat patties are arranged on a tray near the grill. The kitchen is bright and modern, with",
        "environment_sound_description": "The audio features a woman speaking and moving around in a kitchen, with the sounds of cutlery and dishes being used."
    },
    {
        "index": 66,
        "segment": [
            "227310",
            "231940"
        ],
        "video_transcript": "Maybe not the best idea, but hey, I'm crazy girl. ",
        "procedure_description": "",
        "video_clip_description": "In a bright and modern kitchen, a woman with vibrant red hair prepares to cook. She stands near a stainless steel grill, applying oil to its surface with a small bowl in hand, suggesting she is getting ready to grill food. Visible on the counter are several uncooked patties, hinting at a burger-making process. In the background, various kitchen utensils and ingredients, including fresh vegetables and oils, contribute to a well-equipped cooking environment. As she uses tongs to handle the raw meat on",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sounds of cutlery and dishes."
    },
    {
        "index": 67,
        "segment": [
            "231940",
            "233441"
        ],
        "video_transcript": "Place the burgers on the grill. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "A person is cooking ground meat on a hot grill pan, using metal tongs to flip a burger patty. The grill has visible vertical ridges, and the meat shows signs of searing. Nearby, additional raw meat patties are arranged on a tray. The scene emphasizes the cooking process, highlighting the use of utensils to handle the meat safely while keeping the focus on the grilling action.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of cutlery and sizzling indicating the preparation of food."
    },
    {
        "index": 68,
        "segment": [
            "233441",
            "234692"
        ],
        "video_transcript": "You don't need to seasoned them. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "A person is using metal tongs to flip a raw hamburger patty placed on a heated grill. The patty is a rich red color, and there’s steam rising from the grill, indicating cooking. The grill is designed with parallel grooves for proper searing, while a tray holding additional raw patties is visible nearby. The cooking environment appears to be a modern kitchen setup, suggesting a focus on preparing fresh meals.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of cutlery and dishes, indicating a meal preparation."
    },
    {
        "index": 69,
        "segment": [
            "234692",
            "237612"
        ],
        "video_transcript": "They're already seasoned, so don't worry about that. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "In a well-lit kitchen, a woman with curly red hair is grilling hamburger patties on a stovetop grill. She is using metal tongs to manage the cooking beef, showcasing an attentive cooking technique. The grill is producing steam, indicating the patties are sizzling and cooking properly. Various cooking utensils, including spatulas in a container and bottles of oil, are visible on the countertop, highlighting the organized kitchen setup. A tray with additional raw patties sits nearby, emphasizing the preparation of multiple servings",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 70,
        "segment": [
            "237612",
            "240615"
        ],
        "video_transcript": "And cook them about 4 to 6 minutes per side. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "Grilling hamburgers is the central activity, with multiple raw patties placed on a stovetop grill, producing steam. A person, with curly hair and dressed casually, interacts with the grill using tongs to manipulate the patties. The kitchen setting is bright, featuring stainless steel countertops and a variety of cooking utensils and ingredients arranged neatly in the background. Olive oil bottles and a small bowl are within reach, suggesting preparation for flavorful cooking. The overall vibe conveys a lively cooking experience focused on creating delicious",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of frying and stirring, indicating a meal preparation."
    },
    {
        "index": 71,
        "segment": [
            "240615",
            "242367"
        ],
        "video_transcript": "While your burgers are cooking. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "A grill pan is positioned on a stovetop, containing several raw beef patties arranged in a semi-circle. As they cook, steam rises from the patties, indicating heat and moisture. The background features glass bottles of olive oil and a spice container, suggesting preparation for a cooking process. The focus is on the sizzling patties, highlighting their texture and color. The kitchen environment appears tidy and well-organized, enhancing the culinary atmosphere.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of frying and sizzling indicating the use of a pan."
    },
    {
        "index": 72,
        "segment": [
            "242367",
            "244744"
        ],
        "video_transcript": "You can get your special sauce ready. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "Ground beef patties are being cooked on a grill, emitting steam and sizzle as they sear. The patties are thick and juicy, positioned closely together on the grill surface. In the background, various bottles of oil and condiments are visible, suggesting preparation for a flavorful meal. The kitchen setting is bright and modern, with a focus on the grilling process, emphasizing the cooking method and the texture of the meat.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sound of sizzling and stirring, indicating a cooking process is happening."
    },
    {
        "index": 73,
        "segment": [
            "244744",
            "246079"
        ],
        "video_transcript": "Am I allowed to say special sauce? ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "Raw hamburger patties sizzle on a hot grill, releasing steam as they cook. The patties are evenly spaced, showcasing their round shape and pinkish-red color. Oil bottles and a bowl of ingredient mix are positioned in the background, indicating preparation for additional cooking steps. The grill's surface is dark, enhancing the contrast with the raw meat. The overall setting is a kitchen, emphasizing the cooking process and the focus on creating a flavorful dish.",
        "environment_sound_description": "The audio is of a woman cooking, with the sounds of sizzling and stirring, indicating a cooking activity in a kitchen setting."
    },
    {
        "index": 74,
        "segment": [
            "246079",
            "246537"
        ],
        "video_transcript": "Maybe not. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "A grill is set up in a kitchen, with several raw hamburger patties placed on a preheated surface. As they cook, steam rises from the patties, indicating the heat and moisture involved in the process. The grill has horizontal ridges that create sear marks on the patties, enhancing their appearance. In the background, bottles of oil and other cooking ingredients are visible, alongside a small bowl that may contain additional cooking components. The setting conveys an active cooking environment focused on preparing burgers.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 75,
        "segment": [
            "246537",
            "248915"
        ],
        "video_transcript": "I don't know, I don't care. ",
        "procedure_description": "Grill the patties",
        "video_clip_description": "A modern kitchen setting features a woman preparing hamburger patties on a stovetop grill. The scene is filled with steam rising from the cooking patties, indicating they are sizzling. The woman, dressed in a casual white top and dressed apron, stands beside the grill, engaging with the camera while managing the cooking process. The kitchen is well-equipped, with visible objects including a sink, glass bowls, bottles of oil, and various kitchen utensils, creating a lively and organized cooking environment. The focus is primarily",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 76,
        "segment": [
            "248915",
            "250583"
        ],
        "video_transcript": "I said it anyway. ",
        "procedure_description": "",
        "video_clip_description": "A kitchen scene features a woman with curly red hair standing beside a stovetop, where several raw burger patties sizzle on a grill pan, emitting steam. She wears a simple white shirt and a long skirt, and she appears to be in the process of cooking. In the background, a well-organized kitchen showcases stainless steel surfaces, a sink filled with water, and various ingredients such as fresh greens and tomatoes in bowls. Glass bottles of olive oil and vinegar are positioned strategically on the counter,",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 77,
        "segment": [
            "250583",
            "253753"
        ],
        "video_transcript": "You're gonna make your sauce right here in this food processor. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A measuring cup is being used to scoop and pour ingredients into a food processor, indicating a cooking or baking activity. The person is engaged in preparing a mixture, likely involving a creamy or thick ingredient, as evidenced by the texture being transferred. Additional ingredients are also present, including what appears to be oil and maybe dried or chopped peppers, suggesting a recipe that involves both creamy and flavorful components. The setting is kitchen-based, with utensils and ingredients neatly organized on a countertop, emphasizing an orderly cooking process.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring, indicating a cooking process."
    },
    {
        "index": 78,
        "segment": [
            "253753",
            "257590"
        ],
        "video_transcript": "A cup of mayonnaise might work fine. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A kitchen scene involves a person using a metal measuring cup to scoop out a creamy substance, likely a batter or a spread, and transferring it into a food processor. The person's hand is steady, guiding a spatula to assist in scraping out any remaining mixture from the measuring cup. The food processor is clear, showing its contents and positioned on a countertop. The overall setup suggests preparation for cooking or baking, with an organized workspace reflecting a focus on culinary tasks.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of cutlery and dishes, and the sizzling of food being fried or cooked."
    },
    {
        "index": 79,
        "segment": [
            "257590",
            "263137"
        ],
        "video_transcript": "A quarter cup of chopped roasted red peppers. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "In a kitchen setting, various cooking ingredients are being prepared and mixed. A person is using a silver measuring cup to scoop and add ingredients into a food processor, which has a clear container showing a creamy mixture inside. The person is also incorporating chopped red peppers, indicated by their placement next to the measuring cup. The scene suggests a cooking process, possibly focused on creating a sauce or dip, with a focus on adding and blending fresh components. The kitchen environment is bright and clean, enhancing the culinary activity",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling, cutlery, and dishes, indicating a meal preparation process."
    },
    {
        "index": 80,
        "segment": [
            "263137",
            "266724"
        ],
        "video_transcript": "Half a teaspoon of white wine vinegar. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A person with curly red hair is positioned in a well-lit kitchen setting, engaging with a cooking process. They hold a bottle with a black cap over a mixing bowl filled with chopped ingredients, suggesting they are about to add a liquid to the mixture. The bowl is situated on a countertop, and there are glimpses of additional kitchen tools and ingredients in the background, indicating an active cooking environment. The focus is on both the preparatory work and the individual's confident demeanor as they instruct or explain the steps",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 81,
        "segment": [
            "266724",
            "270436"
        ],
        "video_transcript": "Basically like a little more than a splash of white wine vinegar. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A vibrant-haired individual is animatedly preparing a dish in a bright kitchen setting. They express enthusiasm and engage the audience while using various culinary tools. A clear food processor bowl is prominently displayed, filled partially with chopped colorful vegetables, likely ready for blending. A bottle of liquid, presumably a seasoning or sauce, is tilted above the bowl, about to be poured in. The environment is well-lit, emphasizing a fresh and inviting cooking atmosphere, showcasing a lively and interactive cooking demonstration.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 82,
        "segment": [
            "270436",
            "272772"
        ],
        "video_transcript": "And about an eighth of a teaspoon of pepper. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "In a kitchen setting, an individual is engaged in food preparation. They are using a transparent food processor, where red and white ingredients—possibly fruits or a dessert base—are placed. The person is actively adding black pepper or seasoning from a glass and metal grinder, showcasing an intent to enhance flavor. The individual has curly red hair and is positioned in front of a light background, displaying an expressive facial demeanor, suggesting enthusiasm or engagement in their cooking task. The overall scene conveys a lively atmosphere focused on",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying, indicating a meal preparation process."
    },
    {
        "index": 83,
        "segment": [
            "272772",
            "277235"
        ],
        "video_transcript": "Freshly ground if you have it, regular old pepper if you don't. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "The sequence features a food preparation scene, with various steps unfolding to create a dish. A food processor is prominently utilized, showcasing a clear bowl filled with chopped ingredients, likely vegetables such as red peppers, and other components. An individual, seen in a light-colored outfit, is engaged in the cooking process, using a seasoning grinder to add spices, enhancing the flavor of the mixture. The workspace is tidy, emphasizing a modern kitchen aesthetic. The person appears cheerful and animated, engaging with the camera while preparing",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling, cutlery, and dishes, indicating a meal preparation process."
    },
    {
        "index": 84,
        "segment": [
            "277235",
            "285368"
        ],
        "video_transcript": "And then just process that up just until it combines and you have your sauce and that's it. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A woman with short, curly red hair is preparing food in a bright kitchen. She is shown reaching up to a cabinet, retrieving a glass container, likely a food processor bowl. The processor is positioned on the counter, containing chopped ingredients, primarily vibrant red peppers, and possibly other vegetables or fruits. Her hands are engaged in operating the processor, indicating she is in the process of blending or mixing. The kitchen has a clean, modern aesthetic, with a focus on the food preparation task at hand.",
        "environment_sound_description": "The audio is of a woman speaking while operating a blender, followed by the sound of cutlery."
    },
    {
        "index": 85,
        "segment": [
            "285368",
            "287370"
        ],
        "video_transcript": "That's all there is to the sauce. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A woman with short, curly red hair is seen in a bright kitchen, engaging in food preparation. She is positioned to the side, using her right hand to retrieve a lid from a high cabinet, while a large transparent container, possibly a mixing bowl or food processor, rests on the counter in front of her. The kitchen has a clean, modern aesthetic, and ample natural light illuminates the space, creating a warm atmosphere. The focus is on her actions as she prepares ingredients, suggesting a cooking",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sounds of frying and stirring."
    },
    {
        "index": 86,
        "segment": [
            "287370",
            "293501"
        ],
        "video_transcript": "We're all for a special extra fancy and yet very easy burger. ",
        "procedure_description": "Add mayonnaise, red pepper, white wine vinegar, and pepper to a food processor and process it",
        "video_clip_description": "A creamy, pinkish sauce is being poured from a container into a clear glass bowl. The sauce has a smooth, thick texture, and is interacting with the bowl's surface as it flows in. The setting appears to be a kitchen, with a wooden counter emphasizing the rustic ambiance. The focus is on the act of combining or serving the sauce, suggesting its preparation for a dish or accompaniment.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of cutlery and dishes, indicating a meal preparation."
    },
    {
        "index": 87,
        "segment": [
            "293501",
            "295211"
        ],
        "video_transcript": "It's time to flip the burgers now. ",
        "procedure_description": "",
        "video_clip_description": "A person with curly red hair stands at a kitchen counter, using a food processor to blend ingredients into a creamy pink mixture. The food processor is transparent, allowing a view of the mixture's texture as it swirls inside. A glass bowl is positioned nearby, ready to receive the blended contents. The kitchen has a bright ambiance, illuminated by natural light, with cabinets and cooking utensils in the background. The person is focused on the task, indicating a preparation process likely involving cooking or creating a sauce.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling, stirring, and cutlery being used."
    },
    {
        "index": 88,
        "segment": [
            "295211",
            "297171"
        ],
        "video_transcript": "So let me go over there. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A person with curly red hair prepares food in a bright kitchen, displaying a lively cooking process. They are operating a food processor, seemingly blending ingredients. The kitchen is modern, with a focus on cleanliness and functionality. In the foreground, there is a grill with several raw burger patties cooking, creating some steam, indicating active meal preparation. The individual is engaged and animated, likely explaining or demonstrating the cooking techniques, while various cooking utensils and ingredients are neatly arranged on the counters, enhancing the vibrant cooking",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 89,
        "segment": [
            "297171",
            "297880"
        ],
        "video_transcript": "You can't run this. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A well-lit kitchen scene featuring a woman preparing food. She stands near a stainless-steel sink, dressed casually in a white top and skirt, actively engaged in cooking. On the countertop, a griddle holds several burgers sizzling with steam rising, indicating they're being cooked. Various kitchen utensils, including spatulas, are neatly arranged nearby, along with bottles of oils and sauces, hinting at seasoning and preparation steps. The background shows a clean, modern kitchen setup, with drawers and shelves containing additional kitchen",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of stirring and frying, indicating a cooking activity is happening."
    },
    {
        "index": 90,
        "segment": [
            "297880",
            "299590"
        ],
        "video_transcript": "I don't need that anymore. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "In a well-lit kitchen, a person stands in front of a grill pan where several hamburger patties sizzle, releasing steam. They wear a casual outfit, consisting of a fitted white shirt and a skirt, and exhibit a lively demeanor, possibly engaged in explaining or demonstrating the cooking process. Nearby, the kitchen is equipped with modern appliances, a sink, and neatly arranged utensils, including spatulas and bottles of condiments. In the background, ingredients like leafy greens and peppers are visible, suggesting preparation",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of stirring and sizzling indicating the cooking process."
    },
    {
        "index": 91,
        "segment": [
            "299590",
            "301175"
        ],
        "video_transcript": "Time to flip. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A countertop grill is used to cook several hamburger patties, sizzling as they cook. A person is standing in the kitchen near the grill, looking animated and possibly explaining the cooking process. The kitchen setting is bright and modern, featuring stainless steel appliances, various utensils, and ingredients like bottles and greens visible in the background. Smoke rises from the grill, indicating the patties are actively cooking. The individual handles a spatula, likely flipping or adjusting the patties. Overall, the scene conveys an engaging",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring, indicating the cooking process."
    },
    {
        "index": 92,
        "segment": [
            "301175",
            "304137"
        ],
        "video_transcript": "When they're ready to flip, they should be nice and charred. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "Juicy ground beef patties sizzle on a stovetop grill, releasing steam as they cook. A person is actively engaged in the cooking process, holding a spatula poised to flip one of the patties, while another hand gestures, possibly providing instructions or commentary. The kitchen is bright and modern, featuring stainless steel appliances and a clean workspace. Various utensils and ingredients are visible, including olive oil and condiments, contributing to a lively cooking atmosphere. The focus is on the preparation of a hearty",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 93,
        "segment": [
            "304137",
            "306723"
        ],
        "video_transcript": "And it's easy to lift off of the grill. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "Grilling hamburger patties on a stovetop grill, with steam rising as they cook. Some patties are raw and pink, while others are browning and developing grill marks. A person, dressed in a white shirt and brown apron, uses a spatula to turn the patties, demonstrating cooking techniques. The kitchen background features various cooking tools and ingredients, including bottles of oil, bowls, and fresh vegetables, indicating a preparation space. The atmosphere is casual and focused on the process of cooking.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sound of frying food and the sizzle of oil, indicating a cooking process is ongoing."
    },
    {
        "index": 94,
        "segment": [
            "306723",
            "309726"
        ],
        "video_transcript": "If you try to flip them too soon, they'll stick. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "Grilling of hamburgers takes place on a stovetop grill, with several raw patties positioned closely together. Some patties appear uncooked, showing a red color, while one has dark grill marks, indicating it is cooked. A woman with curly hair, wearing a white top, is actively using a spatula to manage the patties. The kitchen background is modern and well-lit, with cooking utensils and ingredients visible on the countertop. Steam rises from the grill, suggesting a high cooking temperature,",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sizzling sound of food being fried, and the woman speaking in the background."
    },
    {
        "index": 95,
        "segment": [
            "309726",
            "311269"
        ],
        "video_transcript": "Don't go too early. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A grilling session of hamburger patties takes place in a well-lit kitchen. Various raw ground beef patties are arranged on a grill pan, some appearing fresh and pink while others are seared with a crispy, browned exterior featuring grill marks. A chef actively engages in cooking, using a pair of tongs to manage the patties, adjusting their position for an even cook. The kitchen features various utensils and ingredients, with a sense of delicious anticipation created by rising steam, enhancing the cooking atmosphere. The",
        "environment_sound_description": "The audio features a woman speaking while cooking, with the background sound of sizzling and frying food, indicating a domestic kitchen setting."
    },
    {
        "index": 96,
        "segment": [
            "311269",
            "318443"
        ],
        "video_transcript": "I feel like I've completely mastered the art of hamburgers, but there are times better to is a spatula better tool? ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A woman with vibrant red, curly hair is featured in a brightly lit kitchen, conveying a mix of surprise and amusement, likely in response to something unexpected. In the background, sizzling hamburger patties are being grilled, with visible steam and the distinct patterns of grill marks showcasing their cooking process. The close-up of the patties highlights their raw and cooked states, indicating a focused culinary activity. The overall atmosphere blends a personal touch from the woman with the dynamic action of cooking, emphasizing the enjoyment and excitement",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying indicating the cooking process."
    },
    {
        "index": 97,
        "segment": [
            "318443",
            "319485"
        ],
        "video_transcript": "I don't know, maybe I should try. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A woman with short, curly red hair and bright lipstick is featured, expressing an emotional reaction, possibly surprise or confusion. She appears to be in a well-lit kitchen setting with a light-colored background. The overall mood is intriguing, suggesting she might be sharing a recipe or cooking experience. Various kitchen utensils and ingredients could be present but are not clearly detailed in the shot. The focus is on her facial expression, indicating engagement with a cooking or food-related topic.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying indicating the cooking process."
    },
    {
        "index": 98,
        "segment": [
            "319485",
            "320695"
        ],
        "video_transcript": "Tom. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A woman with curly red hair and bold makeup expresses a mix of surprise and confusion. She is positioned centrally against a bright, light-colored background, which emphasizes her facial features. The scene conveys a culinary theme, possibly involving a food preparation or tasting moment. Various kitchen utensils and ingredients might be present in the background, creating a casual, homey atmosphere. The overall tone suggests an engaging or comedic take on cooking or food-related content.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 99,
        "segment": [
            "320695",
            "323406"
        ],
        "video_transcript": "Oh, yeah. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "Grilled hamburgers are cooking on a griddle, with visible smoke rising from the meat. The scene captures several patties in various stages of cooking; some are raw and pink, while others are well-cooked, displaying a browned and charred surface with distinct grill marks. A spatula is being used to manipulate the patties, suggesting active grilling. The background is blurred, indicating a kitchen setting, with bright colors hinting at additional ingredients or condiments nearby. The overall ambiance conveys a",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sizzling of food and the sound of dishes and pots."
    },
    {
        "index": 100,
        "segment": [
            "323406",
            "324866"
        ],
        "video_transcript": "It's better. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A grill pan is being used to cook several hamburger patties, emitting steam as they sizzle. One patty is partially raw and pink while the others are browned and have grill marks, indicating varying degrees of doneness. An individual, dressed in a white shirt and gray pants, stands beside the grill, holding a spatula and actively flipping the patties. The kitchen environment is bright and modern, featuring a clutter-free countertop with kitchen utensils, bottles of oil, and fresh ingredients visible in the",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sizzling of food and the sound of dishes and pots and pans being used, indicating a cooking activity."
    },
    {
        "index": 101,
        "segment": [
            "324866",
            "326409"
        ],
        "video_transcript": "Used to be clean up. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A woman with curly red hair is cooking in a modern kitchen, focused on grilling several patties on a stovetop grill. She is wearing a fitted white shirt and light-colored pants, using tongs to carefully flip the patties as smoke rises from the grill. In her kitchen, there are various utensils and bottles visible on the countertop, including oil and seasonings, alongside fresh vegetables in a bowl. The kitchen is well-lit, featuring sleek cabinets and appliances, reflecting an organized cooking space. The",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying, and the woman speaking in the background."
    },
    {
        "index": 102,
        "segment": [
            "326409",
            "327618"
        ],
        "video_transcript": "Make sure you have clean pants. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A woman with curly red hair is cooking in a well-lit kitchen, where steam is rising from a grilling surface. She is positioned to the left, actively using tongs to manage several burgers that are visibly sizzling on the grill. The kitchen is modern, featuring a large island with a clean countertop and various kitchen utensils and condiments neatly arranged. There are bottles of olive oil and other liquids, along with a bowl of fresh greens. The background shows various kitchen appliances, indicating a functional cooking space.",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sound of sizzling and frying food in the background, indicating a domestic setting where cooking is taking place."
    },
    {
        "index": 103,
        "segment": [
            "327618",
            "330997"
        ],
        "video_transcript": "Not the ones that you use when you're running. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "A person is grilling multiple beef patties on a stove, using a pair of tongs to flip or maneuver them. The patties are well-seared with distinct grill marks and are surrounded by smoke, indicating high heat and cooking activity. In the background, a modern kitchen is visible, equipped with various cooking utensils, a sink, and appliances like a microwave and food processor. Olive oil bottles and other condiments are neatly arranged on the countertop, suggesting preparation for a meal. The overall scene conveys",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sizzling of food and the sound of frying (sizzle) present throughout the duration of the audio."
    },
    {
        "index": 104,
        "segment": [
            "330997",
            "332623"
        ],
        "video_transcript": "All right, 3 to 4 more minutes. ",
        "procedure_description": "Flip the burger patties on the grill and cook",
        "video_clip_description": "Grilled hamburger patties are arranged on a flat cooking surface, with visible grill marks and steam rising from them, indicating they are cooked and juicy. The patties appear thick and seared, suggesting a high-heat cooking method, likely on a stovetop grill or griddle. The background is softly blurred, emphasizing the focus on the sizzling burgers, creating an appetizing and warm atmosphere typical of grilling food.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sizzling of food and the sound of dishes being used, indicating a cooking activity is taking place."
    },
    {
        "index": 105,
        "segment": [
            "332623",
            "337837"
        ],
        "video_transcript": "I'm going to play some tomatoes up, slice up a tomato or two. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Grilling juicy, grilled burgers emits steam and sizzles, showcasing perfectly charred marks on each patty placed on a grill surface. In a separate scene, a hand grips a vibrant red bell pepper on a clean, light-colored cutting board, suggesting preparation for fresh toppings or a side dish. Both elements highlight the cooking process and flavor enhancement for a meal centered around grilled meat.",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sound of sizzling and frying food in the background, indicating a domestic kitchen setting."
    },
    {
        "index": 106,
        "segment": [
            "337837",
            "343176"
        ],
        "video_transcript": "Make sure your knife is nice and sharp. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "A hand is seen holding a bright red bell pepper, with a focus on the texture and vibrant color of the vegetable. The hand is positioned on the pepper, indicating preparation or inspection, and the background consists of a wooden table surface, enhancing the fresh, natural themes. The overall atmosphere suggests a cooking or food preparation context, likely indicating the beginning of a recipe involving the bell pepper.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 107,
        "segment": [
            "343176",
            "346179"
        ],
        "video_transcript": "Serrated knives also work really well for tomatoes. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "A hand is positioned over a bright red bell pepper, applying pressure to it against a wooden surface. The focus is on the interaction between the hand and the pepper, suggesting a preparation or cooking process. The bell pepper appears shiny and fresh, indicative of high quality. The hand, adorned with a ring, demonstrates a deliberate action, potentially emphasizing the start of a slicing or chopping procedure. The overall scene is well-lit, creating a visually inviting atmosphere suitable for culinary activities.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 108,
        "segment": [
            "346179",
            "357940"
        ],
        "video_transcript": "Spread some of your homemade special sauce on one side of each bun, and then if you want a little bit of mustard, why not a combination of spicy and a little bit sweet? ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "A variety of ingredients and preparation steps for making sandwiches are depicted. Slices of soft sandwich bread, some already spread with a pinkish sauce, are arranged on a counter. A jar of wholegrain mustard is visible nearby, indicating it may be an ingredient in the recipe. Fresh spinach is seen in a bowl, suggesting a healthy addition. A person with curly red hair is engaged in the preparation, focusing intently on the task. There is also a close-up of a creamy mixture being stirred in",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying indicating the cooking process."
    },
    {
        "index": 109,
        "segment": [
            "357940",
            "359567"
        ],
        "video_transcript": "Really nice. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "A woman with curly, vibrant red hair stands in a bright kitchen, appearing focused on an activity. She wears a simple, fitted white top and is positioned slightly angled, with her head turned down as if observing or preparing something on a countertop or stove area. Behind her, light pours in through a large window, illuminating the space. A white cabinet is visible, suggesting a clean and minimalistic kitchen design. Several cooking utensils and appliances may be positioned in her workspace, indicating that she is engaged in",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and stirring indicating the cooking process."
    },
    {
        "index": 110,
        "segment": [
            "359567",
            "363654"
        ],
        "video_transcript": "I mean, obviously use whatever condiments appeal to you. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Sliced sandwich rolls are placed on a flat, white serving plate. Each roll has a layer of mustard spread evenly on the inner side, while some rolls are also topped with a sprinkle of seeds or spices. A person is using a knife to apply mustard to one of the rolls, holding it with one hand and spreading with the other. The setting appears to be a kitchen, with additional ingredients possibly nearby, indicating preparation for a sandwich assembly. The focus is on preparing these rolls with mustard for an",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and mechanisms present throughout, indicating the use of kitchen appliances like a microwave or stove."
    },
    {
        "index": 111,
        "segment": [
            "363654",
            "367450"
        ],
        "video_transcript": "This is just this is where I'm going today, guys. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Consecutive screenshots depict a kitchen scene focused on food preparation. A person applies mustard to sandwich buns on a white plate. There are several sandwich bun halves seated on the plate, with a smooth layer of mustard spread on some and one untouched. The person's hand, holding a knife, is actively spreading the mustard, showing an engaged approach to making a sandwich. The background features light-colored kitchen elements and a bright, airy atmosphere, suggesting a casual setting. The individual preparing the food has short, curly red",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying, indicating the use of a pan or skillet."
    },
    {
        "index": 112,
        "segment": [
            "367450",
            "370370"
        ],
        "video_transcript": "Slice of tomato. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Fresh tomatoes are sliced on a wooden cutting board, showcasing their vibrant red color and juicy interior. A hand is engaged in peeling or preparing these slices for further use. In the backdrop, a person with curly red hair, dressed in a light-colored top, appears to be engaged in cooking activities at a kitchen counter. The environment is bright and well-lit, suggesting a lively kitchen atmosphere focused on food preparation. Various kitchen objects may be subtly present but not explicitly detailed.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying, indicating the use of a pan or skillet for cooking."
    },
    {
        "index": 113,
        "segment": [
            "370370",
            "374082"
        ],
        "video_transcript": "These are so big, you really only need one of those. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Slices of bright red tomatoes are being arranged on sandwich buns, which have been spread with a creamy sauce. The tomatoes, cut in a decorative way, display their seeds and juicy interior. A hand is seen delicately placing the tomato slices on the buns, demonstrating care in creating an appealing presentation. The buns are placed on a white plate, and nearby, additional tomato slices sit on a cutting board. There’s a focus on the freshness and vibrant color of the ingredients, conveying a sense of preparation for",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sounds of sizzling and frying food in the background, indicating a domestic setting where cooking is taking place."
    },
    {
        "index": 114,
        "segment": [
            "374082",
            "376125"
        ],
        "video_transcript": "Look like flowers are so cute. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Slices of bread are arranged on a white plate, with one slice featuring a creamy spread on top. Several tomato slices are placed on the adjacent bread slices, showcasing their vibrant red color and unique patterns due to the seeds and inner structure. A hand is reaching to add more slices, emphasizing careful placement and attention to detail in the layering process. The overall presentation highlights the preparation of a fresh and visually appealing sandwich or burger, focusing on the freshness of the ingredients.",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sounds of frying and sizzling indicating the cooking process."
    },
    {
        "index": 115,
        "segment": [
            "376125",
            "378044"
        ],
        "video_transcript": "And then a little bit of greens. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "A plate displays toasted sandwich buns, with one side spread with a pink sauce. Fresh, sliced tomatoes are arranged artfully on the buns, showcasing their bright red color and juicy texture. The buns are positioned side by side, with the tomatoes placed directly on the open halves, likely preparing for a sandwich assembly. The scene suggests a focus on fresh ingredients and an appealing presentation, highlighting the process of making a flavorful, visually appealing dish.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying, indicating a meal preparation process."
    },
    {
        "index": 116,
        "segment": [
            "378044",
            "383466"
        ],
        "video_transcript": "I'm using baby spinach today, but obviously use whatever you have on hand or whatever appeals to you. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "A food preparation scene unfolds, where a person is assembling ingredients for a meal. Slices of red tomato are carefully placed on cut buns, which have a spread on them, suggesting the making of a sandwich or burger. In another moment, a person expresses an emotion, likely concern or confusion, while looking toward the camera, indicating a narrative or commentary element in the video. Additionally, fresh spinach is being picked from a bowl, highlighting the selection of fresh ingredients, which suggests an emphasis on healthy eating",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sound of frying food in the background."
    },
    {
        "index": 117,
        "segment": [
            "383466",
            "387845"
        ],
        "video_transcript": "This is to continue your steak house theme of the blue cheese and the spinach. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "Fresh spinach leaves are being picked from a glass bowl and carefully placed on slices of tomato that are layered on top of bread. A hand is engaged in arranging the spinach over the tomatoes, indicating a focus on building a healthy sandwich or salad. The scene emphasizes vibrant colors with green spinach, red tomatoes, and the brownish hue of the bread, creating an appetizing and visually appealing meal preparation process. The use of a simple kitchen setup highlights a casual cooking environment.",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sound of frying food in the background."
    },
    {
        "index": 118,
        "segment": [
            "387845",
            "392683"
        ],
        "video_transcript": "You know how you get creamed spinach steak steakhouse and now you're already. ",
        "procedure_description": "Slice the tomatoes, spread the sauce on the burger base, and place tomato and spinach on top",
        "video_clip_description": "In a bright kitchen setting, fresh ingredients are being prepared for a meal. A plate filled with sandwich bases displays layers of sliced tomatoes topped with green spinach leaves. Hand movements are evident as greens are being tossed or arranged, showcasing the process of assembling fresh ingredients. A person, with curly red hair and a casual white top, engages playfully with the camera, possibly sharing tips or enjoying the cooking experience. The overall activity suggests a focus on healthy eating, highlighting the preparation of nutritious sandwiches or salads.",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the background sound of sizzling and frying, indicating a domestic kitchen setting."
    },
    {
        "index": 119,
        "segment": [
            "392683",
            "396312"
        ],
        "video_transcript": "All you have to do is get your burgers off the grill and I think mine are ready. ",
        "procedure_description": "Place the patties in between the buns",
        "video_clip_description": "Lettuce and tomato layers are prepared on sandwich buns, creating a fresh base. A person, with curly red hair, interacts with the camera, likely speaking or engaging the audience with enthusiasm. Subsequently, a close-up shows a hand pressing down on sizzling meat patties on a grill, showcasing cooking techniques. The scene blends elements of food preparation, presentation, and a dynamic personality, emphasizing a lively cooking atmosphere focused on creating delicious meals.",
        "environment_sound_description": "The audio is of a woman speaking while cooking, with the sounds of sizzling and stirring."
    },
    {
        "index": 120,
        "segment": [
            "396312",
            "399315"
        ],
        "video_transcript": "One burger yummy. ",
        "procedure_description": "Place the patties in between the buns",
        "video_clip_description": "The scene features the preparation of a burger, showcasing various steps in the cooking process. A hand is positioned above a plate with a burger patty, which sits alongside fresh vegetables such as leafy greens and possibly tomatoes. The patty appears juicy and well-cooked. In another close-up, a hand grips a spatula, skillfully flipping a burger on a grill. The grill marks on the patties indicate they are being cooked thoroughly, with steam rising, suggesting a hot cooking environment. The focus",
        "environment_sound_description": "The audio features a woman speaking while cooking, with the sound of sizzling and stirring."
    },
    {
        "index": 121,
        "segment": [
            "399315",
            "401442"
        ],
        "video_transcript": "She's. ",
        "procedure_description": "Place the patties in between the buns",
        "video_clip_description": "The video features the process of assembling a gourmet burger. A hand is prominently positioned, skillfully placing a juicy, grilled patty onto a bed of fresh greens, including vibrant lettuce and possibly tomatoes. The surface appears clean and well-prepared for food presentation, indicating a focus on culinary detail. Utensils and additional ingredients may be subtly suggested in the background, enhancing the atmosphere of a home-cooking environment. The overall ambiance conveys a sense of care and precision in preparing an elevated meal.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying, indicating the use of a frying pan or similar cooking device."
    },
    {
        "index": 122,
        "segment": [
            "401442",
            "403361"
        ],
        "video_transcript": "The burgers are good. ",
        "procedure_description": "Place the patties in between the buns",
        "video_clip_description": "In the video, a close-up of hands assembling a burger is featured. A juicy, well-cooked patty is positioned on a plate, surrounded by fresh ingredients like lettuce and potentially sliced tomatoes or other toppings. The emphasis is on the layers of the burger as the hands carefully handle the components, suggesting a focus on the preparation process. The setting appears to be a kitchen, with soft lighting enhancing the food's appeal. The overall presentation is vibrant, showcasing a delicious and appetizing approach to burger",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of frying and stirring, along with the sound of dishes and pots and pans."
    },
    {
        "index": 123,
        "segment": [
            "403361",
            "409242"
        ],
        "video_transcript": "All right, pop them off. ",
        "procedure_description": "Place the patties in between the buns",
        "video_clip_description": "In a bright, modern kitchen, an individual prepares a meal, focusing on building burgers. Ingredients like grilled patties, fresh greens, and condiments are spread across the counter. A grill is used for cooking meat, emitting traces of steam and smoke. The cook carefully assembles the burgers, layering vegetables and sauces, ensuring an appealing presentation. The kitchen is organized, featuring tools and cooking equipment, and the atmosphere conveys a sense of culinary creativity and efficiency.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling, stirring, and cutlery being used."
    },
    {
        "index": 124,
        "segment": [
            "409242",
            "412620"
        ],
        "video_transcript": "That is cute. ",
        "procedure_description": "Place the patties in between the buns",
        "video_clip_description": "A modern kitchen setting features a woman preparing food. She is actively engaged in assembling burgers, which are placed on a cutting board. Various ingredients, including vegetables and sauces, are spread out nearby, demonstrating meal prep. A grill pan holds cooking patties, giving a sense of an ongoing cooking process. The kitchen is bright and clean, emphasizing a professional environment with organized utensils and appliances in the background. The woman is poised, focused on her task, conveying a sense of efficiency and culinary expertise.",
        "environment_sound_description": "The audio features a woman speaking while cooking, with the sound of sizzling and frying food in the background, indicating a domestic setting where cooking is taking place."
    },
    {
        "index": 125,
        "segment": [
            "412620",
            "417667"
        ],
        "video_transcript": "Thank how delicious that looks. ",
        "procedure_description": "",
        "video_clip_description": "In a modern kitchen, a person prepares delicious burgers. The countertop is organized, featuring cooking tools, jars of ingredients, and fresh vegetables. A grill pan on the stove displays sizzling patties, while the individual assembles the burgers with lettuce, tomato, and other toppings between toasted sesame buns. A plate showcasing four completed burgers is held prominently, highlighting their appetizing appearance with fresh greens and vibrant colors. The overall presentation emphasizes a casual yet engaging cooking process, focused on creating a satisfying meal.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of frying and stirring, along with the sound of dishes and pots and pans."
    },
    {
        "index": 126,
        "segment": [
            "417667",
            "420294"
        ],
        "video_transcript": "Look at that. ",
        "procedure_description": "",
        "video_clip_description": "A person holding a white plate filled with four freshly made hamburgers is central to the scene. Each hamburger features a toasted sesame seed bun, a beef patty, leafy greens, and a layer of red sauce, likely ketchup. The person’s attire is casual, featuring a plain white shirt, indicating a relaxed kitchen or dining setting. The arrangement of the burgers highlights their appetizing presentation, with vibrant colors contrasting against the white plate. The overall atmosphere conveys a sense of meal preparation or serving in a",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of frying and stirring indicating the cooking process."
    },
    {
        "index": 127,
        "segment": [
            "420294",
            "424632"
        ],
        "video_transcript": "Those are so deluxe, so fantastic, and really so easy. ",
        "procedure_description": "",
        "video_clip_description": "A woman with curly red hair is in a bright kitchen, holding a white plate stacked with four sesame seed burgers. The burgers each contain a beef patty, lettuce, and tomato, presented appetizingly. The kitchen features a stainless-steel sink, countertop utensils, and a food processor in the background. A bowl of salad can be seen nearby, suggesting a focus on fresh ingredients. The overall atmosphere is light and inviting, showcasing a casual cooking environment.",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sounds of sizzling and frying indicating the food is being cooked."
    },
    {
        "index": 128,
        "segment": [
            "424632",
            "427260"
        ],
        "video_transcript": "You should definitely make them for your next barbecue. ",
        "procedure_description": "",
        "video_clip_description": "A vibrant and inviting kitchen scene features a woman with curly red hair, wearing a white shirt and beige pants. She proudly holds a plate of visually appealing burgers, which display toasted sesame seed buns, fresh vegetables, and a creamy sauce. The kitchen backdrop is bright and modern, showcasing various utensils and cooking tools, indicating an organized and cheerful cooking environment. The countertop includes a bowl with salad ingredients and a blender, suggesting meal preparation. The atmosphere is friendly, encouraging viewers to engage with the cooking process while",
        "environment_sound_description": "The audio is of a woman cooking in a kitchen, with the sound of sizzling and frying food, and the background music."
    },
    {
        "index": 129,
        "segment": [
            "427260",
            "428970"
        ],
        "video_transcript": "I would. ",
        "procedure_description": "",
        "video_clip_description": "A cheerful host presents cooking tips and recipes in a bright, modern kitchen. She engages with the audience while demonstrating various dishes. Key objects include a whole roasted chicken placed in a serving dish, colorful decorated cupcakes on a cooling rack, and a plated dish featuring meat and greens with flatbreads. Various cooking utensils, ingredients in bowls, and kitchen equipment are visible, emphasizing a vibrant and inviting cooking environment. The layout includes instructional elements, encouraging viewers to subscribe for more recipes.",
        "environment_sound_description": "The audio features a woman speaking, followed by the sound of frying food, and finally, music."
    },
    {
        "index": 130,
        "segment": [
            "428970",
            "437520"
        ],
        "video_transcript": "Hi guys. ",
        "procedure_description": "",
        "video_clip_description": "A lively kitchen setting features a woman with curly red hair enthusiastically engaging the audience. She wears a simple white shirt and beige apron while discussing various cooking topics. Positioned prominently behind her are stainless steel cabinets and neatly arranged kitchen equipment. In the foreground, elements like cooked chicken, colorful cupcakes topped with sprinkles, and a plated dish with sliced meat and greens highlight diverse culinary creations. Clips indicate different recipes or cooking techniques, suggesting a focus on everyday meal preparation. On-screen prompts encourage viewers to subscribe for",
        "environment_sound_description": "The audio is of a woman speaking in a home theater setting."
    },
    {
        "index": 131,
        "segment": [
            "437520",
            "439063"
        ],
        "video_transcript": "Thanks for watching this video. ",
        "procedure_description": "",
        "video_clip_description": "A woman with curly red hair stands in a bright kitchen, engaging with the audience while presenting various cooking techniques and dishes. She wears a casual white top and gray pants, positioned confidently at a countertop. The kitchen is modern and well-equipped, featuring stainless steel appliances, pots, and various cooking tools. In the clip, there are visual highlights of delicious food items, including a roast chicken, decorated cupcakes, and a plated dish of meat with greens and pita. The overall atmosphere is inviting and informative,",
        "environment_sound_description": "The audio is a combination of music and a woman speaking, possibly in a home theater setting, with the background noise of a car passing by."
    },
    {
        "index": 132,
        "segment": [
            "439063",
            "442525"
        ],
        "video_transcript": "Be sure to click here if you want to subscribe and click over here. ",
        "procedure_description": "",
        "video_clip_description": "A cooking tutorial features an engaging host in a bright kitchen setting, showcasing various dishes. The host appears lively and animated, wearing a casual outfit, while gesturing toward the camera. Prominently displayed are several prepared dishes, including a golden-brown roasted chicken on a platter, decorated cupcakes with colorful sprinkles, and a plated meat dish alongside greens and flatbreads. Other elements include cooking utensils and ingredients arranged neatly on the counters, contributing to the inviting and organized aesthetic of the kitchen. Text",
        "environment_sound_description": "The audio is of a woman speaking in a kitchen, with the sounds of cutlery and dishes."
    },
    {
        "index": 133,
        "segment": [
            "442525",
            "445695"
        ],
        "video_transcript": "If you want to continue watching more great videos like this. ",
        "procedure_description": "",
        "video_clip_description": "A vibrant kitchen setting features a woman with curly red hair, wearing a casual outfit, enthusiastically demonstrating cooking techniques. She gestures while explaining recipes, showcasing various prepared dishes displayed nearby, including a golden roast chicken, colorful cupcakes adorned with sprinkles, and a plate of sliced meat with accompaniments. The kitchen is modern and well-equipped, with stainless steel appliances and neatly organized utensils. The video invites viewers to subscribe for more everyday recipes, emphasizing accessibility and enjoyment in cooking.",
        "environment_sound_description": "The audio is of a woman speaking in a kitchen setting, with the sounds of dishes and pots and pans clanging in the background."
    }
]