[
    {
        "index": 1,
        "segment": [
            0,
            "4212"
        ],
        "transcript_sentence": "a Are you looking for an over the top burger experience? ",
        "procedure_annotation": "Divide the blue cheese into pieces",
        "visual_scene_description": "The scene shows a person in a kitchen preparing to cut a piece of cheese on a cutting board. They are wearing gloves and have a variety of ingredients on the counter, including a bowl of ground meat and a bottle with a dark liquid. The kitchen appears modern with stainless steel counters and shelves filled with utensils and containers."
    },
    {
        "index": 2,
        "segment": [
            "4212",
            "7507"
        ],
        "transcript_sentence": "If you are you've come to the right place. ",
        "procedure_annotation": "",
        "visual_scene_description": "The current scene shows a hand reaching for two large red tomatoes next to a sink. Nearby, there's a jar of mustard and some sesame seed burger buns. A bowl of fresh greens is also visible. At the bottom, text reads \"EVERYDAY FOOD.\""
    },
    {
        "index": 3,
        "segment": [
            "7507",
            "14222"
        ],
        "transcript_sentence": "Today I'm making a blue cheese stuffed burger with a red pepper mayonnaise sauce. ",
        "procedure_annotation": "",
        "visual_scene_description": "The current scene shows cream-colored contents being spun in a food processor. The mixture appears to be blending smoothly inside the transparent container."
    },
    {
        "index": 4,
        "segment": [
            "14222",
            "17058"
        ],
        "transcript_sentence": "Sort of like special sauce but with red peppers. ",
        "procedure_annotation": "",
        "visual_scene_description": "The current scene shows several open-faced sandwiches. They have slices of tomato on a bun topped with fresh green leaves, likely spinach or a similar leafy green, arranged neatly on a white plate."
    },
    {
        "index": 5,
        "segment": [
            "17058",
            "17934"
        ],
        "transcript_sentence": "It's really delicious. ",
        "procedure_annotation": "",
        "visual_scene_description": "The scene shows a close-up of open-faced sandwiches being prepared. Each sandwich features a slice of tomato and a layer of spinach leaves on a bun. The setup appears to be part of a food preparation process, possibly for making burgers or sandwiches, with ingredients neatly assembled on a white tray."
    },
    {
        "index": 6,
        "segment": [
            "17934",
            "19352"
        ],
        "transcript_sentence": "I'll get to that in a few minutes. ",
        "procedure_annotation": "",
        "visual_scene_description": "The current scene features a close-up of four burgers on a white plate. The burgers have sesame seed buns and appear to contain beef patties, leafy greens, and slices of tomato. The background is slightly blurred, focusing attention on the burgers, with the text \"EVERYDAY FOOD\" visible on the bottom right corner."
    },
    {
        "index": 7,
        "segment": [
            "19352",
            "21646"
        ],
        "transcript_sentence": "But first I'm making my burger mix. ",
        "procedure_annotation": "",
        "visual_scene_description": "The scene shows a close-up of a rectangular white plate holding four hamburgers. Each burger is topped with a sesame seed bun and contains a beef patty, fresh spinach, and tomato slices. An \"Everyday Food\" logo is visible in the bottom right corner."
    },
    {
        "index": 8,
        "segment": [
            "21646",
            "25358"
        ],
        "transcript_sentence": "I'm dividing a piece of blue cheese into eight pieces. ",
        "procedure_annotation": "",
        "visual_scene_description": "A person wearing gloves is cutting blue cheese on a wooden cutting board. The cheese is crumbly, and the knife is in the process of slicing through a piece. The setting appears to be a kitchen."
    },
    {
        "index": 9,
        "segment": [
            "25358",
            "27277"
        ],
        "transcript_sentence": "This could be any kind of cheese that you want. ",
        "procedure_annotation": "",
        "visual_scene_description": "The scene shows a person in a kitchen setting, wearing a white shirt and gloves, chopping ingredients on a cutting board. There's a bowl of ground meat and some seasoning ingredients on the counter. The kitchen appears modern with stainless steel fixtures and various kitchen equipment in the background. The person seems to be explaining or demonstrating a cooking process."
    },
    {
        "index": 10,
        "segment": [
            "27277",
            "29696"
        ],
        "transcript_sentence": "Brie would work, cheddar would work, etc. ",
        "procedure_annotation": "",
        "visual_scene_description": "The scene takes place in a bright kitchen where a woman with curly red hair, dressed in a white shirt and wearing gloves, is finely chopping a block of blue cheese on a wooden cutting board. Various kitchen appliances and containers are visible in the background, and a glass bowl with minced meat and seasoning is placed nearby on the counter."
    },
    {
        "index": 11,
        "segment": [
            "29696",
            "30488"
        ],
        "transcript_sentence": "etc. ",
        "procedure_annotation": "",
        "visual_scene_description": "The scene shows a person wearing gloves, cutting or crumbling blue cheese on a wooden cutting board using a knife. The focus is on the cheese and the hands working with it, with visible blue veins typical of blue cheese. The logo \"EVERYDAY FOOD\" is seen in the bottom right corner."
    },
    {
        "index": 12,
        "segment": [
            "30488",
            "33074"
        ],
        "transcript_sentence": "so I've divided my blue cheese into eight pieces. ",
        "procedure_annotation": "",
        "visual_scene_description": "In this scene, a person wearing gloves is chopping and arranging pieces of blue cheese on a wooden cutting board. A knife is visible being used to cut the cheese. The setting appears to be a kitchen work area."
    },
    {
        "index": 13,
        "segment": [
            "33074",
            "34325"
        ],
        "transcript_sentence": "You may notice I'm wearing gloves. ",
        "procedure_annotation": "",
        "visual_scene_description": "A person is in a kitchen setting, wearing a white shirt and a gray apron, with curly red hair. They're putting on gloves and may be preparing to handle food or cooking. On a countertop, there is a cutting board with small dough pieces, a knife, and a large glass bowl filled with minced meat. Behind them, kitchen tools and ingredients are visible."
    },
    {
        "index": 14,
        "segment": [
            "34325",
            "37954"
        ],
        "transcript_sentence": "I'm just doing that because blue cheese does have kind of a strong scent. ",
        "procedure_annotation": "",
        "visual_scene_description": "In the scene, a woman with curly red hair is in a modern kitchen. She is wearing a white top and gloves, working with small pieces of dough on a chopping board. Various kitchen supplies and a bowl of ground meat are visible on the countertop. The atmosphere appears bright and tidy, with kitchen equipment and ingredients organized neatly in the background."
    },
    {
        "index": 15,
        "segment": [
            "37954",
            "42459"
        ],
        "transcript_sentence": "And if you are concerned about that on your hands, wear a pair of gloves. ",
        "procedure_annotation": "",
        "visual_scene_description": "The current scene shows a person in a kitchen wearing white gloves and a white shirt, preparing small pieces of cheese or similar food on a cutting board. There is a knife on the board, and a bowl filled with ground meat is nearby. The kitchen is modern, with jars and appliances on the counters in the background. The person appears to be in the process of cooking or preparing a dish, possibly explaining or demonstrating the steps."
    },
    {
        "index": 16,
        "segment": [
            "42459",
            "45211"
        ],
        "transcript_sentence": "Also, I'm going to be touching meat and then I won't have to wash my hands. ",
        "procedure_annotation": "",
        "visual_scene_description": "In the current scene, a person wearing a white shirt and gloves is in a kitchen setting. They are interacting with a bowl of ground meat placed on a cutting board. The countertop is organized with ingredients and utensils, and there are various kitchen appliances and jars in the background. It appears to be a cooking demonstration or preparation scene."
    },
    {
        "index": 17,
        "segment": [
            "45211",
            "47047"
        ],
        "transcript_sentence": "Here I have 3 pounds of meat. ",
        "procedure_annotation": "",
        "visual_scene_description": "In the scene, a person wearing gloves is handling a large amount of ground beef in a glass bowl. A knife is placed on a wooden cutting board next to the bowl. This setting appears to be part of a food preparation process."
    },
    {
        "index": 18,
        "segment": [
            "47047",
            "51426"
        ],
        "transcript_sentence": "It's ground chuck to that I'm going to add a tablespoon of course salt. ",
        "procedure_annotation": "",
        "visual_scene_description": "The current scene shows a person wearing white gloves holding a spoonful of salt over a bowl of ground meat. The setting is a kitchen with a wooden cutting board, a knife, and small pieces of butter nearby. The atmosphere suggests a cooking or food preparation process."
    },
    {
        "index": 19,
        "segment": [
            "51426",
            "59684"
        ],
        "transcript_sentence": "If you're using fine salt or if you're using a particularly salty brand, of course salt, use a teaspoon and a half to two teaspoons. ",
        "procedure_annotation": "",
        "visual_scene_description": "A person wearing gloves is in a kitchen setting, preparing to mix seasoning with ground meat in a clear bowl. They are sprinkling salt over the meat. Various kitchen items and ingredients are visible in the background."
    },
    {
        "index": 20,
        "segment": [
            "59684",
            "63438"
        ],
        "transcript_sentence": "Also going to season the meat with a teaspoon of freshly ground black pepper. ",
        "procedure_annotation": "",
        "visual_scene_description": "In the first image, a person in a white shirt is standing in a kitchen, preparing food. They're holding a spoon and a bowl of ground meat with seasoning on a counter. A bottle of sauce and some small cups are nearby. \n\nIn the second image, a gloved hand is holding a small bowl with ground pepper, next to a baking tray lined with parchment paper.\n\nIn the third image, the gloved hand is adding pepper from the bowl into the bowl of seasoned ground meat."
    }
]